AddressBook/src/main/resources/com/sijiang/webservice/soap/message_format/AddPersonRequest.xml

<?xml version="1.0" encoding="utf-8"?>

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/">
	<soapenv:Header />
	<soapenv:Body>
		<add:OpenAccountRequest xmlns:add="http://addressbook.com/add_person">
			<age>5</age>
			<firstname>adadsds</firstname>
			<lastname>csdvsdfv</lastname>
			<username>csdvsdfv</username>>
		</add:OpenAccountRequest>
	</soapenv:Body>
</soapenv:Envelope>